InformationRegisters/ВерсииОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбщихЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсииПриЗакрытии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВерсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВерсийСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсииОбщихЗадач/Ext/ManagerModule.bsl
Процедура УвеличитьВерсию(ТипВерсии, НомерВерсииТекущий = 0, ПриЗакрытии = Ложь, Пользователь = Неопределено) Экспорт
	
	ПользовательДляЗаписи = ПолучитьПользователяДляЗаписи(Пользователь);	
	
	МенеджерЗаписей = РегистрыСведений.ВерсииОбщихЗадач.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписей.Пользователь 	= ПользовательДляЗаписи;
	МенеджерЗаписей.ТипВерсии 		= ТипВерсии;
	
	МенеджерЗаписей.Прочитать();
	
	Если МенеджерЗаписей.Выбран() Тогда
	
		Если ПриЗакрытии Тогда
			МенеджерЗаписей.НомерВерсииПриЗакрытии = НомерВерсииТекущий;	
		Иначе
			МенеджерЗаписей.НомерВерсии = ?(МенеджерЗаписей.НомерВерсии > 99999, 1, МенеджерЗаписей.НомерВерсии  + 1);	
		КонецЕсли;
		
	Иначе
		
		МенеджерЗаписей.Пользователь 	= ПользовательДляЗаписи;
		МенеджерЗаписей.ТипВерсии 		= ТипВерсии;
		
		Если ПриЗакрытии Тогда
			МенеджерЗаписей.НомерВерсииПриЗакрытии = НомерВерсииТекущий;	
		Иначе
			МенеджерЗаписей.НомерВерсии = 1;	
		КонецЕсли;

	КонецЕсли;
	
	МенеджерЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьНомерВерсии(ТипВерсии = Неопределено, Пользователь = Неопределено) Экспорт  
	
	ПользовательДляЗаписи = ПолучитьПользователяДляЗаписи(Пользователь); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбщихЗадач.ТипВерсии КАК ТипВерсии,
		|	ВерсииОбщихЗадач.НомерВерсии КАК НомерВерсии,
		|	ВерсииОбщихЗадач.НомерВерсииПриЗакрытии КАК НомерВерсииПриЗакрытии
		|ИЗ
		|	РегистрСведений.ВерсииОбщихЗадач КАК ВерсииОбщихЗадач
		|ГДЕ
		|	ВерсииОбщихЗадач.Пользователь = &Пользователь
		|	И ВЫБОР
		|			КОГДА &ТипВерсии = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВерсииОбщихЗадач.ТипВерсии = &ТипВерсии
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Пользователь", 	ПользовательДляЗаписи);
	Запрос.УстановитьПараметр("ТипВерсии", 		ТипВерсии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПерваяЗапись = Истина;
	НомерЗаписи = 0;
	
	Пока Выборка.Следующий() Цикл
		Если ПерваяЗапись Тогда
			
			ПерваяЗапись = Ложь;
			
			Если ТипВерсии = Неопределено Тогда 
				ДанныеНомерВерсии = Новый Массив(Выборка.Количество());	
			Иначе
				Возврат Новый Структура("НомерВерсии, НомерВерсииПриЗакрытии"
								, Выборка.НомерВерсии, Выборка.НомерВерсииПриЗакрытии);
				
			КонецЕсли; 
		КонецЕсли;
		
		ДанныеНомерВерсии[НомерЗаписи] =  Новый Структура("ТипВерсии, НомерВерсии, НомерВерсииПриЗакрытии"
															, Выборка.ТипВерсии
															, Выборка.НомерВерсии
															, Выборка.НомерВерсииПриЗакрытии);
		НомерЗаписи = НомерЗаписи + 1;
		
	КонецЦикла;
	
	Если ПерваяЗапись Тогда
		
		Если ТипВерсии = Неопределено Тогда
			Возврат Новый Массив;
		КонецЕсли;
		
		Возврат Новый Структура("НомерВерсии, НомерВерсииПриЗакрытии", -1, -1);		
		
	КонецЕсли; 
	
	Возврат ДанныеНомерВерсии;
	
КонецФункции // ПолучитьНомерВерсии() 

Функция ПолучитьПользователяДляЗаписи(Пользователь)

	Возврат ?(Пользователь = Неопределено, 
				ПараметрыСеанса.ТекущийПользователь,
				Пользователь);
	

КонецФункции // ПолучитьПользователяДляЗаписи()
